{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 64, 1], "name": "the_input", "sparse": false}, "inbound_nodes": [], "name": "the_input"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["the_input", 0, 0, {}]]], "name": "conv1"}, {"class_name": "MaxPooling2D", "config": {"name": "max1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "max1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max1", 0, 0, {}]]], "name": "conv2"}, {"class_name": "MaxPooling2D", "config": {"name": "max2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "max2"}, {"class_name": "Reshape", "config": {"target_shape": [32, 256], "trainable": true, "name": "reshape"}, "inbound_nodes": [[["max2", 0, 0, {}]]], "name": "reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "dense1"}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "gru1", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["dense1", 0, 0, {}]]], "name": "gru1"}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "gru1_b", "bias_constraint": null, "go_backwards": true, "implementation": 0, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["dense1", 0, 0, {}]]], "name": "gru1_b"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["gru1", 0, 0, {}], ["gru1_b", 0, 0, {}]]], "name": "add_1"}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "gru2", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "gru2"}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "gru2_b", "bias_constraint": null, "go_backwards": true, "implementation": 0, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "gru2_b"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["gru2", 0, 0, {}], ["gru2_b", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "dense2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 28, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "softmax"}, "inbound_nodes": [[["dense2", 0, 0, {}]]], "name": "softmax"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 16], "name": "the_labels", "sparse": false}, "inbound_nodes": [], "name": "the_labels"}, {"class_name": "InputLayer", "config": {"dtype": "int64", "batch_input_shape": [null, 1], "name": "input_length", "sparse": false}, "inbound_nodes": [], "name": "input_length"}, {"class_name": "InputLayer", "config": {"dtype": "int64", "batch_input_shape": [null, 1], "name": "label_length", "sparse": false}, "inbound_nodes": [], "name": "label_length"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000sM\u0000\u0000\u0000|\u0000\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000|\u0001\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0003\u0000\u0019}\u0001\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000|\u0001\u0000|\u0003\u0000|\u0004\u0000\u0083\u0004\u0000S(\u0002\u0000\u0000\u0000Ni\u0002\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u000e\u0000\u0000\u0000ctc_batch_cost(\u0005\u0000\u0000\u0000t\u0004\u0000\u0000\u0000argst\u0006\u0000\u0000\u0000y_predt\u0006\u0000\u0000\u0000labelst\f\u0000\u0000\u0000input_lengtht\f\u0000\u0000\u0000label_length(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\f\u0000\u0000\u0000image_ocr.pyt\u000f\u0000\u0000\u0000ctc_lambda_func?\u0001\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\u0012\u0003%\u0001", null, null], "name": "ctc", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [1], "output_shape_type": "raw"}, "inbound_nodes": [[["softmax", 0, 0, {}], ["the_labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "name": "ctc"}], "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["ctc", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}